Revit 2023 API
ReinforcementSettings.GetFabricRoundingManager Method
 Returns an object for managing reinforcement rounding override settings used by FabricSheetType and FabricSheet elements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2014
Syntax
C#
public FabricRoundingManager GetFabricRoundingManager()
Visual Basic
Public Function GetFabricRoundingManager As FabricRoundingManager
Visual C++
public:
FabricRoundingManager^ GetFabricRoundingManager()
Return Value
 The rounding manager.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace